<template>
  <el-dialog 
    :title="type === 1 ? '基础统计表-释义' : (type === 2 ? '展厅统计表-释义' : (type === 3 ? 'DCC部门统计表-释义' : '单店考核任务表释义'))" 
    :visible.sync="dialogShow"
    :close-on-click-modal="false" 
    :before-close="handleClose" 
    width="1200px">
    <div v-if="type !== 4">
        <el-table 
            :data="type === 1 ? basicExplain : (type === 2 ? exhibitionExplain : (type === 3 ? dccExplain : false))" 
            border 
            class="explain" 
            size="small"
            height="490">
            <el-table-column prop="type" label="类型" width="67px"></el-table-column>
            <el-table-column label="释义" width="255px">
                <template slot-scope="scope">
                    <div v-for="(item, index) in scope.row.typeExplain" :key="index" class="padding-10 text-left">
                        {{item}}
                    </div>
                </template>
            </el-table-column>
            <el-table-column label="统计数据" width="140px">
                <template slot-scope="scope">
                <div v-for="item in scope.row.statistics" :key="item.label" class="content-rowspan">
                    <span>{{item.label}}</span>
                </div>
                </template>
            </el-table-column>
            <el-table-column label="释义" width="680px">
                <template slot-scope="scope">
                <div v-for="(item, i) in scope.row.statistics" :key="i" class="content-rowspan">
                    <div class="text-left">
                        <p v-for="(ex, k) in item.explain" :key="k">{{ex}}</p>
                    </div>
                </div>
                </template>
            </el-table-column>
        </el-table>
    </div>

    <div v-if="type === 4">
        <el-table :data="shopExplain" border class="taskExplain">
            <el-table-column prop="item" label="项目"></el-table-column>
            <el-table-column prop="describe" label="说明"></el-table-column>
            <el-table-column prop="target" label="目标"></el-table-column>
        </el-table>
    </div>
    
  </el-dialog>
</template>

<script>
  export default {
    props: ['type'],
    data() {
      return {
        dialogShow: true,
        loading: false,
        basicExplain: [  // 基础统计释义
            {
                type: '客流',
                typeExplain: ['【字段解释】统计分析汽车销冠客流管理模块的相关数据，若未使用客流模块，则该模块数据为空；',
                    '【基础数据来源】PC后台-客户管理-售前客户管理-客流管理'
                ],
                statistics: [{
                    label: '客流总数',
                    explain: ['【字段解释】根据展厅的客流量，通过汽车销冠创建的客流总数；',
                    '【计算规则】客流总数=首次到店客流总数+二次到店客流总数+非意向客流总数+未完善客流总数'
                    ]
                }, {
                    label: '首次到店客流总数',
                    explain: ['【字段解释】客流类型为首次到店看车的客流数，可细分为三类：首次到店并留档、已建卡首次到店、看车未留档；',
                    '【计算规则】首次到店客流总数=首次到店并留档+已建卡首次到店+看车未留档'
                    ]
                }, {
                    label: '首次到店并留档',
                    explain: ['【字段解释】客流类型为首次到店看车并留档的客流数，此数据也代表展厅客流的建卡数；']
                }, {
                    label: '已建卡首次到店',
                    explain: ['【字段解释】客流类型为已经建卡但属于首次到店的客流数，此类客户一般是：DCC首次邀约到店的客户，车展已建卡首次邀约到店的客户等；']
                }, {
                    label: '看车未留档',
                    explain: ['【字段解释】客流类型为意向潜客到店看车但并未留档的客流数；']
                }, {
                    label: '再次到店客流总数',
                    explain: ['【字段解释】客流类型为已经建卡并再次到店看车的客流数，此类客户一般是：再次邀约到店看车的客户；']
                }, {
                    label: '非意向客流总数',
                    explain: ['【字段解释】客流类型为非意向的客流数，可细分为五类：办理手续，办理交车，办理退订，维修保养，其他；']
                }, {
                    label: '未完善客流总数',
                    explain: ['【字段解释】创建了展厅客流信息，但顾问未对客流信息进行完善的客流数量；']
                }, {
                    label: '客流留档率',
                    explain: ['【字段解释】客流中意向潜客的留档比率；',
                    '【计算规则】客流留档率=首次到店并留档/(首次到店并留档+看车未留档)'
                    ]
                }]
            }, {
                type: '线索',
                typeExplain: ['【字段解释】统计分析汽车销冠线索管理模块的相关数据，若未使用线索模块，则该模块数据为空；',
                    '【基础数据来源】PC后台-客户管理-售前客户管理-线索管理'
                ],
                statistics: [{
                    label: 'DCC线索总数',
                    explain: [
                    '【字段解释】线索管理模块通过人工导入下发及系统自动下发的DCC线索总数，仅包含导入成功（号码去重）且分配过顾问的线索；线索总数可根据处理状态可细分为：有效建卡、非意向、已有档案、待跟进；',
                    '【计算规则】DCC线索总数=有效建卡+非意向+已有档案+待跟进'
                    ]
                }, {
                    label: '有效建卡',
                    explain: ['【字段解释】通过汽车销冠APP线索池进行DCC线索跟进后，确认线索有效且有效建卡的线索数，此数据也代表DCC线索建卡数；']
                }, {
                    label: '非意向',
                    explain: [
                    '【字段解释】通过汽车销冠APP线索池进行DCC线索跟进后，确认线索无效且标记成非意向的线索数，非意向类型可细分为：空错号、多次无人接听、无购车意向、已购本品、已购竞品、省外客户、本省其他地区客户、其他；'
                    ]
                }, {
                    label: '已有档案',
                    explain: [
                    `【字段解释】DCC线索导入或下发到线索池后，顾问未对线索进行有效建卡或标记非意向，通过其他非线索池渠道（展厅客流建卡等）对该线索进行了建卡操作，则该线索标记成已有档案；
                                                        已有档案统计不包含：导入线索时已经有档案存在而被去重且无法的线索数；`
                    ]
                }, {
                    label: '待跟进',
                    explain: ['【字段解释】已经分配给顾问但还未进行跟进处理的线索数；']
                }, {
                    label: 'DCC线索建卡率',
                    explain: ['【字段解释】DCC线索跟进处理后，有效建卡的线索的占比，计算时不包含待跟进的线索数；',
                    '【计算规则】DCC线索建卡率=有效建卡/（有效建卡+非意向+已有档案）*100%'
                    ]
                }]
            }, {
                type: '建卡',
                typeExplain: ['【字段解释】统计分析汽车销冠建卡模块的相关数据；',
                    '【基础数据来源】PC后台-客户管理-售前客户管理-潜客管理'
                ],
                statistics: [{
                    label: '建卡总数',
                    explain: [
                    '【字段解释】通过汽车销冠建卡的潜客总数；跟进建卡渠道可细分为：展厅客流建卡、DCC线索建卡、其他建卡；',
                    '【计算规则】建卡总数=展厅客流建卡+DCC线索建卡+其他建卡'
                    ]
                }, {
                    label: '展厅客流建卡',
                    explain: ['【字段解释】完善展厅客流时，同步进行了建卡操作的潜客总数，等于客流统计中的“首次到店并留档”数；']
                }, {
                    label: 'DCC线索建卡',
                    explain: [
                    '【字段解释】处理线索池DCC线索时，进行了建卡操作的潜客总数，等于线索统计中的“有效建卡”数；'
                    ]
                }, {
                    label: '其他建卡',
                    explain: [
                    `【字段解释】通过APP首页“+”号直接建档（无客流信息的车展客户、外拓客户等），或通过后台潜客管理直接导入（系统初次启用导入之前系统的潜客）的潜客数；`
                    ]
                }]
            }, {
                type: '试驾',
                typeExplain: ['【字段解释】统计分析汽车销冠试驾模块的相关数据；',
                    '【基础数据来源】PC后台-业务咨询-试驾预约'
                ],
                statistics: [{
                    label: '试驾总数',
                    explain: [
                    '【字段解释】通过汽车销冠进行了试驾登记的试驾总数，包含智能试驾及普通试驾；',
                    '【计算规则】试驾总数=智能试驾+普通试驾'
                    ]
                }, {
                    label: '智能试驾',
                    explain: ['【字段解释】通过汽车销冠进行了智能试驾登记的试驾数，智能试驾需完成：扫描驾照、签署电子试驾协议等操作；']
                }, {
                    label: '普通试驾',
                    explain: [
                    '【字段解释】通过汽车销冠进行了普通试驾登记的试驾数，普通试驾只需要在补充客流信息时选择事件“试驾”，无需扫描驾照及签署电子试驾协议等操作；'
                    ]
                }, {
                    label: '到店客户试驾率',
                    explain: [
                    '【字段解释】计算客流列表中，所有到店看车潜客的试驾率；',
                    '【计算规则】到店客户试驾率=试驾总数/（首次到店并留档+已建卡首次到店+再次到店客流总数）'
                    ]
                }, {
                    label: '到店客户智能试驾率',
                    explain: [
                    '【字段解释】计算客流列表中，所有到店看车潜客的智能试驾率；',
                    '【计算规则】到店客户智能试驾率=智能试驾/（首次到店并留档+已建卡首次到店+再次到店客流总数）'
                    ]
                }]
            }, {
                type: '跟进',
                typeExplain: ['【字段解释】统计分析汽车销冠跟进模块的相关数据；',
                    '【基础数据来源】PC后台-客户管理-售前客户管理-潜客管理'
                ],
                statistics: [{
                    label: '试驾总数',
                    explain: [
                    '【字段解释】通过汽车销冠进行了试驾登记的试驾总数，包含智能试驾及普通试驾；',
                    '【计算规则】试驾总数=智能试驾+普通试驾'
                    ]
                }, {
                    label: '跟进总数',
                    explain: ['【字段解释】通过汽车销冠进行了跟进总数，跟进方式包含：智能通话、普通电话、其他跟进；',
                    '【计算规则】跟进总数=智能通话+普通电话+其他跟进'
                    ]
                }, {
                    label: '智能通话',
                    explain: [
                    '【字段解释】通过汽车销冠的智能通话（通话录音及通话时长）功能进行的跟进数；'
                    ]
                }, {
                    label: '普通电话',
                    explain: [
                    `【字段解释】通过汽车销冠的普通电话（电话标签及通话时长）功能进行的跟进数；`
                    ]
                }, {
                    label: '其他跟进',
                    explain: [
                    `【字段解释】未通过汽车销冠进行智能电话或普通电话呼出，直接添加跟进记录的跟进数；`
                    ]
                }]
            }, {
                type: '邀约',
                typeExplain: ['【字段解释】统计分析汽车销冠邀约到店的相关数据；',
                    '【基础数据来源】PC后台-客户管理-售前客户管理-潜客管理'
                ],
                statistics: [{
                    label: '邀约到店总数',
                    explain: [
                    '【字段解释】代表所有已建卡客户首次邀约到店或再次邀约到店的总次数，对应客流列表中的客流类型为：已建卡首次到店客流、再次到店客流；',
                    '【计算规则】邀约到店总数=已建卡首次到店客流+再次到店客流=已登记邀约到店+未登记邀约到店'
                    ]
                }, {
                    label: '已登记邀约到店',
                    explain: ['【字段解释】若该客户邀约到店前，顾问通过汽车销冠对该客户添加了“邀约”事件及计划，且客户按计划到店，则该客户判断为已登记邀约到店；']
                }, {
                    label: '未登记邀约到店',
                    explain: [
                    '【字段解释】若该客户邀约到店前，顾问未通过汽车销冠对该客户添加了“邀约”事件及计划，或客户未按计划到店，则该客户判断为未登记邀约到店；'
                    ]
                }, {
                    label: '邀约到店客户占比',
                    explain: [
                    `【字段解释】到店看车潜客中，邀约到店的客户所占比例；`,
                    '【计算规则】邀约到店客户占比=邀约到店总数/（首次到店客流总数+再次到店客流总数）'
                    ]
                }]
            }, {
                type: '成交',
                typeExplain: ['【字段解释】统计分析汽车销冠下订及交车的相关数据；',
                    '【基础数据来源】PC后台-客户管理-售前客户管理-订单管理'
                ],
                statistics: [{
                    label: '总订单数',
                    explain: [
                    '【字段解释】通过汽车销冠进行下订操作的订单总数，包含：首次到店并留档下订、已建卡首次到店下订、再次到店下订、其他下订；',
                    '【计算规则】总订单数=首次到店并留档下订+已建卡首次到店下订+再次到店下订+其他下订'
                    ]
                }, {
                    label: '首次到店并留档下订',
                    explain: ['【字段解释】客流类型为首次到店看车并留档，且进行下订操作的订单数；']
                }, {
                    label: '已建卡首次到店下订',
                    explain: [
                    '【字段解释】客流类型为已建卡首次到店，且进行下订操作的订单数；'
                    ]
                }, {
                    label: '再次到店下订',
                    explain: ['【字段解释】客流类型为再次到店，且进行下订操作的订单数；']
                }, {
                    label: '其他下订',
                    explain: ['【字段解释】直接通过添加跟进记录进行下订的订单数，该订单不是在补充客流时同步进行的下订操作；']
                }, {
                    label: '首次到店并留档成交率',
                    explain: [
                    '【字段解释】客流类型为首次到店看车并留档客户的到店成交率；',
                    '【计算规则】首次到店并留档成交率=首次到店并留档下订数/首次到店并留档客流数'
                    ]
                }, {
                    label: '已建卡首次到店成交率',
                    explain: [
                    '【字段解释】客流类型为已建卡首次到店客户的到店成交率；',
                    '【计算规则】已建卡首次到店成交率=已建卡首次到店下订数/已建卡首次到店客流数'
                    ]
                }, {
                    label: '再次到店成交率',
                    explain: ['【字段解释】客流类型为再次到店客户的到店成交率；',
                    '【计算规则】再次到店成交率=再次到店下订数/再次到店客流数']
                }, {
                    label: '交车数',
                    explain: [`【字段解释】通过汽车销冠进行交车操作的交车总数；`]
                }, {
                    label: '退订数',
                    explain: [`【字段解释】通过汽车销冠进行取消订单操作的退订总数；`]
                }]
            }, {
                type: '战败',
                typeExplain: ['【字段解释】统计分析汽车销冠战败管理的相关数据；',
                    '【基础数据来源】PC后台-客户管理-售前客户管理-战败管理'
                ],
                statistics: [{
                    label: '申请战败总数',
                    explain: [
                    '【字段解释】通过汽车销冠进行申请战败的申请总数，战败申请的处理状态可分为：已同意战败、已拒绝战败、未处理战败；',
                    '【计算规则】申请战败总数=已同意战败+已拒绝战败+未处理战败'
                    ]
                }, {
                    label: '已同意战败',
                    explain: ['【字段解释】汽车销冠的战败申请中，已进行同意战败操作的申请数；']
                }, {
                    label: '已拒绝战败',
                    explain: [
                    '【字段解释】汽车销冠的战败申请中，已进行不同意战败操作的申请数；'
                    ]
                }, {
                    label: '未处理战败',
                    explain: [
                    `【字段解释】汽车销冠的战败申请中，还未进行战败审核的申请数；`
                    ]
                }, {
                    label: '战败审核拒绝率',
                    explain: [
                    `【字段解释】申请战败总数中，审核中进行了不同意战败操作申请数的所占比例；`,
                    '【计算规则】战败审核拒绝率=已拒绝战败/申请战败总数'
                    ]
                }]
        }],
        exhibitionExplain: [  // 展厅统计释义
            {
                type: '客流',
                typeExplain: ['【字段解释】统计分析汽车销冠客流管理模块的相关数据，若未使用客流模块，则该模块数据为空；',
                    '【取值范围】展厅销售顾问',
                    '【基础数据来源】PC后台-客户管理-售前客户管理-客流管理'],
                statistics: [{
                    label: '客流总数',
                    explain: ['【字段解释】根据展厅的客流量，通过汽车销冠创建的客流总数；',
                    '【计算规则】客流总数=首次到店客流总数+二次到店客流总数+非意向客流总数+未完善客流总数'
                    ]
                }, {
                    label: '首次到店客流总数',
                    explain: ['【字段解释】客流类型为首次到店看车的客流数，可细分为三类：首次到店并留档、已建卡首次到店、看车未留档；',
                    '【计算规则】首次到店客流总数=首次到店并留档+已建卡首次到店+看车未留档'
                    ]
                }, {
                    label: '首次到店并留档',
                    explain: ['【字段解释】客流类型为首次到店看车并留档的客流数，此数据也代表展厅客流的建卡数；']
                }, {
                    label: '已建卡首次到店',
                    explain: ['【字段解释】客流类型为已经建卡但属于首次到店的客流数，此类客户一般是：DCC首次邀约到店的客户，车展已建卡首次邀约到店的客户等；']
                }, {
                    label: '看车未留档',
                    explain: ['【字段解释】客流类型为意向潜客到店看车但并未留档的客流数；']
                }, {
                    label: '再次到店客流总数',
                    explain: ['【字段解释】客流类型为已经建卡并再次到店看车的客流数，此类客户一般是：再次邀约到店看车的客户；']
                }, {
                    label: '非意向客流总数',
                    explain: ['【字段解释】客流类型为非意向的客流数，可细分为五类：办理手续，办理交车，办理退订，维修保养，其他；']
                }, {
                    label: '未完善客流总数',
                    explain: ['【字段解释】创建了展厅客流信息，但顾问未对客流信息进行完善的客流数量；']
                }, {
                    label: '客流留档率',
                    explain: ['【字段解释】客流中意向潜客的留档比率；',
                    '【计算规则】客流留档率=首次到店并留档/(首次到店并留档+看车未留档)'
                    ]
                }]
            }, {
                type: '建卡',
                typeExplain: ['【字段解释】统计分析汽车销冠建卡模块的相关数据；',
                    '【取值范围】展厅销售顾问',
                    '【基础数据来源】PC后台-客户管理-售前客户管理-潜客管理'
                ],
                statistics: [{
                    label: '建卡总数',
                    explain: [
                    '【字段解释】通过汽车销冠建卡的潜客总数；跟进建卡渠道可细分为：展厅客流建卡、DCC线索建卡、其他建卡；',
                    '【计算规则】建卡总数=展厅客流建卡+DCC线索建卡+其他建卡'
                    ]
                }, {
                    label: '展厅客流建卡',
                    explain: ['【字段解释】完善展厅客流时，同步进行了建卡操作的潜客总数，等于客流统计中的“首次到店并留档”数；']
                }, {
                    label: '其他建卡',
                    explain: [
                    `【字段解释】通过APP首页“+”号直接建档（无客流信息的车展客户、外拓客户等），或通过后台潜客管理直接导入（系统初次启用导入之前系统的潜客）的潜客数；`
                    ]
                }, {
                    label: '本月初遗留潜客数',
                    explain: [
                    '【字段解释】本月月初1号凌晨0点，遗留未成交的潜客数，包含：H级、A级、B级、C级；'
                    ]
                }]
            }, {
                type: '试驾',
                typeExplain: ['【字段解释】统计分析汽车销冠试驾模块的相关数据；',
                    '【取值范围】展厅销售顾问',
                    '【基础数据来源】PC后台-业务咨询-试驾预约'
                ],
                statistics: [{
                    label: '试驾总数',
                    explain: [
                    '【字段解释】通过汽车销冠进行了试驾登记的试驾总数，包含智能试驾及普通试驾；',
                    '【计算规则】试驾总数=智能试驾+普通试驾'
                    ]
                }, {
                    label: '智能试驾',
                    explain: ['【字段解释】通过汽车销冠进行了智能试驾登记的试驾数，智能试驾需完成：扫描驾照、签署电子试驾协议等操作；']
                }, {
                    label: '普通试驾',
                    explain: [
                    '【字段解释】通过汽车销冠进行了普通试驾登记的试驾数，普通试驾只需要在补充客流信息时选择事件“试驾”，无需扫描驾照及签署电子试驾协议等操作；'
                    ]
                }, {
                    label: '到店客户试驾率',
                    explain: [
                    '【字段解释】计算客流列表中，所有到店看车潜客的试驾率；',
                    '【计算规则】到店客户试驾率=试驾总数/（首次到店并留档+已建卡首次到店+再次到店客流总数）'
                    ]
                }, {
                    label: '到店客户智能试驾率',
                    explain: [
                    '【字段解释】计算客流列表中，所有到店看车潜客的智能试驾率；',
                    '【计算规则】到店客户智能试驾率=智能试驾/（首次到店并留档+已建卡首次到店+再次到店客流总数）'
                    ]
                }]
            }, {
                type: '邀约',
                typeExplain: ['【字段解释】统计分析汽车销冠邀约到店的相关数据；',
                    '【取值范围】展厅销售顾问',
                    '【基础数据来源】PC后台-客户管理-售前客户管理-潜客管理'
                ],
                statistics: [{
                    label: '邀约到店总数',
                    explain: [
                    '【字段解释】代表所有已建卡客户首次邀约到店或再次邀约到店的总次数，对应客流列表中的客流类型为：已建卡首次到店客流、再次到店客流；',
                    '【计算规则】邀约到店总数=已建卡首次到店客流+再次到店客流=已登记邀约到店+未登记邀约到店'
                    ]
                }, {
                    label: '邀约到店率',
                    explain: [
                    `【字段解释】已留档潜客邀约到店的比率；`,
                    '【计算规则】邀约到店率=邀约到店总数/（本月建卡总数+本月初遗留潜客数）'
                    ]
                }]
            }, {
                type: '成交',
                typeExplain: ['【字段解释】统计分析汽车销冠下订及交车的相关数据；',
                    '【取值范围】展厅销售顾问',
                    '【基础数据来源】PC后台-客户管理-售前客户管理-订单管理'
                ],
                statistics: [{
                    label: '订单数',
                    explain: [
                    '【字段解释】通过汽车销冠进行下订操作的订单总数；']
                }, {
                    label: '潜客转化率',
                    explain: ['【字段解释】已留档潜客下订单的比率；',
                    '【计算规则】潜客转化率=订单数/（本月建卡总数+本月初遗留潜客数）']
                }, {
                    label: '战败数',
                    explain: [
                    '【字段解释】通过汽车销冠进行战败操作的战败总数，仅包含已同意战败的战败客户数；'
                    ]
                }, {
                    label: '战败率',
                    explain: [
                    `【字段解释】已留档潜客战败的比率；`,
                    '【计算规则】战败率=战败数/（本月战败总数+本月初遗留潜客数）'
                    ]
                }, {
                    label: '本月初遗留订单数',
                    explain: ['【字段解释】本月月初1号凌晨0点，遗留未交车的订单数；']
                }, {
                    label: '交车数',
                    explain: [
                    `【字段解释】通过汽车销冠进行交车操作的交车总数；`]
                }, {
                    label: '订单交车率',
                    explain: [
                    `【字段解释】已下订客户的交车比率；`,
                    '【计算规则】订单交车率=交车数/（本月下订总数+本月初遗留订单数）'
                    ]
                }, {
                    label: '退订数',
                    explain: [`【字段解释】通过汽车销冠进行取消订单操作的退订总数；`]
                }, {
                    label: '订单退订率',
                    explain: [
                    `【字段解释】已下订客户的退订比率；`,
                    '【计算规则】订单退订率=退订数/（本月下订总数+本月初遗留订单数）'
                    ]
                }]
        }],
        dccExplain: [  // DCC部门统计释义
            {
                type: '客流',
                typeExplain: ['【字段解释】统计分析汽车销冠客流管理模块的相关数据，若未使用客流模块，则该模块数据为空；',
                    '【取值范围】DCC邀约员及网销顾问',
                    '【基础数据来源】PC后台-客户管理-售前客户管理-客流管理'],
                statistics: [{
                    label: '客流总数',
                    explain: ['【字段解释】根据展厅的客流量，通过汽车销冠创建的客流总数；',
                    '【计算规则】客流总数=首次到店客流总数+二次到店客流总数+非意向客流总数+未完善客流总数'
                    ]
                }, {
                    label: '首次到店客流总数',
                    explain: ['【字段解释】客流类型为首次到店看车的客流数，可细分为三类：首次到店并留档、已建卡首次到店、看车未留档；',
                    '【计算规则】首次到店客流总数=首次到店并留档+已建卡首次到店+看车未留档'
                    ]
                }, {
                    label: '首次到店并留档',
                    explain: ['【字段解释】客流类型为首次到店看车并留档的客流数，此数据也代表展厅客流的建卡数；']
                }, {
                    label: '已建卡首次到店',
                    explain: ['【字段解释】客流类型为已经建卡但属于首次到店的客流数，此类客户一般是：DCC首次邀约到店的客户，车展已建卡首次邀约到店的客户等；']
                }, {
                    label: '看车未留档',
                    explain: ['【字段解释】客流类型为意向潜客到店看车但并未留档的客流数；']
                }, {
                    label: '再次到店客流总数',
                    explain: ['【字段解释】客流类型为已经建卡并再次到店看车的客流数，此类客户一般是：再次邀约到店看车的客户；']
                }, {
                    label: '非意向客流总数',
                    explain: ['【字段解释】客流类型为非意向的客流数，可细分为五类：办理手续，办理交车，办理退订，维修保养，其他；']
                }, {
                    label: '未完善客流总数',
                    explain: ['【字段解释】创建了展厅客流信息，但顾问未对客流信息进行完善的客流数量；']
                }, {
                    label: '客流留档率',
                    explain: ['【字段解释】客流中意向潜客的留档比率；',
                    '【计算规则】客流留档率=首次到店并留档/(首次到店并留档+看车未留档)'
                    ]
                }]
            }, {
                type: '线索',
                typeExplain: ['【字段解释】统计分析汽车销冠线索管理模块的相关数据，若未使用线索模块，则该模块数据为空；',
                    '【取值范围】DCC邀约员及网销顾问',
                    '【基础数据来源】PC后台-客户管理-售前客户管理-线索管理'
                ],
                statistics: [{
                    label: 'DCC线索总数',
                    explain: [
                    '【字段解释】线索管理模块通过人工导入下发及系统自动下发的DCC线索总数，仅包含导入成功（号码去重）且分配过顾问的线索；线索总数可根据处理状态可细分为：有效建卡、非意向、已有档案、待跟进；',
                    '【计算规则】DCC线索总数=有效建卡+非意向+已有档案+待跟进'
                    ]
                }, {
                    label: '有效建卡',
                    explain: ['【字段解释】通过汽车销冠APP线索池进行DCC线索跟进后，确认线索有效且有效建卡的线索数，此数据也代表DCC线索建卡数；']
                }, {
                    label: '非意向',
                    explain: [
                    '【字段解释】通过汽车销冠APP线索池进行DCC线索跟进后，确认线索无效且标记成非意向的线索数，非意向类型可细分为：空错号、多次无人接听、无购车意向、已购本品、已购竞品、省外客户、本省其他地区客户、其他；'
                    ]
                }, {
                    label: '已有档案',
                    explain: [
                    `【字段解释】DCC线索导入或下发到线索池后，顾问未对线索进行有效建卡或标记非意向，通过其他非线索池渠道（展厅客流建卡等）对该线索进行了建卡操作，则该线索标记成已有档案；
                                                        已有档案统计不包含：导入线索时已经有档案存在而被去重且无法的线索数；`
                    ]
                }, {
                    label: '待跟进',
                    explain: ['【字段解释】已经分配给顾问但还未进行跟进处理的线索数；']
                }, {
                    label: 'DCC线索建卡率',
                    explain: ['【字段解释】DCC线索跟进处理后，有效建卡的线索的占比，计算时不包含待跟进的线索数；',
                    '【计算规则】DCC线索建卡率=有效建卡/（有效建卡+非意向+已有档案）*100%'
                    ]
                }]
            }, {
                type: '建卡',
                typeExplain: ['【字段解释】统计分析汽车销冠建卡模块的相关数据；',
                    '【取值范围】DCC邀约员及网销顾问',
                    '【基础数据来源】PC后台-客户管理-售前客户管理-潜客管理'
                ],
                statistics: [{
                    label: '建卡总数',
                    explain: [
                    '【字段解释】通过汽车销冠建卡的潜客总数；跟进建卡渠道可细分为：展厅客流建卡、其他建卡；',
                    '【计算规则】建卡总数=展厅客流建卡+其他建卡'
                    ]
                }, {
                    label: 'DCC线索建卡',
                    explain: ['【字段解释】处理线索池DCC线索时，进行了建卡操作的潜客总数，等于线索统计中的“有效建卡”数；']
                }, {
                    label: '其他建卡',
                    explain: [
                    `【字段解释】通过APP首页“+”号直接建档（无客流信息的车展客户、外拓客户等），或通过后台潜客管理直接导入（系统初次启用导入之前系统的潜客）的潜客数；`
                    ]
                }, {
                    label: '本月初遗留潜客数',
                    explain: [
                    '【字段解释】本月月初1号凌晨0点，遗留未成交的潜客数，包含：H级、A级、B级、C级；'
                    ]
                }]
            }, {
                type: '试驾',
                typeExplain: ['【字段解释】统计分析汽车销冠试驾模块的相关数据；',
                    '【取值范围】DCC邀约员及网销',
                    '【基础数据来源】PC后台-业务咨询-试驾预约'
                ],
                statistics: [{
                    label: '试驾总数',
                    explain: [
                    '【字段解释】通过汽车销冠进行了试驾登记的试驾总数，包含智能试驾及普通试驾；',
                    '【计算规则】试驾总数=智能试驾+普通试驾'
                    ]
                }, {
                    label: '智能试驾',
                    explain: ['【字段解释】通过汽车销冠进行了智能试驾登记的试驾数，智能试驾需完成：扫描驾照、签署电子试驾协议等操作；']
                }, {
                    label: '普通试驾',
                    explain: [
                    '【字段解释】通过汽车销冠进行了普通试驾登记的试驾数，普通试驾只需要在补充客流信息时选择事件“试驾”，无需扫描驾照及签署电子试驾协议等操作；'
                    ]
                }, {
                    label: '到店客户试驾率',
                    explain: [
                    '【字段解释】计算客流列表中，所有到店看车潜客的试驾率；',
                    '【计算规则】到店客户试驾率=试驾总数/（首次到店并留档+已建卡首次到店+再次到店客流总数）'
                    ]
                }, {
                    label: '到店客户智能试驾率',
                    explain: [
                    '【字段解释】计算客流列表中，所有到店看车潜客的智能试驾率；',
                    '【计算规则】到店客户智能试驾率=智能试驾/（首次到店并留档+已建卡首次到店+再次到店客流总数）'
                    ]
                }]
            }, {
                type: '邀约',
                typeExplain: ['【字段解释】统计分析汽车销冠邀约到店的相关数据；',
                    '【取值范围】DCC邀约员及网销顾问',
                    '【基础数据来源】PC后台-客户管理-售前客户管理-潜客管理'
                ],
                statistics: [{
                    label: '邀约到店总数',
                    explain: [
                    '【字段解释】代表所有已建卡客户首次邀约到店或再次邀约到店的总次数，对应客流列表中的客流类型为：已建卡首次到店客流、再次到店客流；',
                    '【计算规则】邀约到店总数=首次邀约到店+二次邀约到店=已建卡首次到店客流+再次到店客流'
                    ]
                }, {
                    label: '首次邀约到店',
                    explain: ['【字段解释】代表所有已建卡客户首次邀约到店的客户数，对应客流列表中的客流类型为：已建卡首次到店客流；']
                }, {
                    label: '再次邀约到店',
                    explain: [ '【字段解释】代表所有再次邀约到店的总次数，对应客流列表中的客流类型为：再次到店客流；']
                },{
                    label: '邀约到店率',
                    explain: [
                    '【字段解释】已留档潜客邀约到店的比率；',
                    '【计算规则】邀约到店率=邀约到店总数/（本月建卡总数+本月初遗留潜客数）'
                    ]
                }, {
                    label: '首次邀约到店率',
                    explain: [
                    `【字段解释】已留档潜客首次邀约到店的比率；`,
                    '【计算规则】邀约到店率=首次邀约到店数/（本月建卡总数+本月初遗留潜客数）']
                }, {
                    label: '再次邀约到店率',
                    explain: [
                    '【字段解释】已留档潜客再次邀约到店的比率；',
                    '【计算规则】邀约到店率=再次邀约到店数/（本月建卡总数+本月初遗留潜客数）']
                }]
            }, {
                type: '成交',
                typeExplain: ['【字段解释】统计分析汽车销冠下订及交车的相关数据；',
                    '【取值范围】DCC邀约员及网销顾问',
                    '【基础数据来源】PC后台-客户管理-售前客户管理-订单管理'
                ],
                statistics: [{
                    label: '订单数',
                    explain: [
                    '【字段解释】通过汽车销冠进行下订操作的订单总数；']
                },{
                    label: '邀约到店成交率',
                    explain: [
                    '【字段解释】邀约到店客户下订单的比例；',
                    '【计算规则】邀约到店成交率=订单数/邀约到店总数']
                }, {
                    label: '潜客转化率',
                    explain: ['【字段解释】已留档潜客下订单的比率；',
                    '【计算规则】潜客转化率=订单数/（本月建卡总数+本月初遗留潜客数）']
                }, {
                    label: '战败数',
                    explain: [
                    '【字段解释】通过汽车销冠进行战败操作的战败总数，仅包含已同意战败的战败客户数；'
                    ]
                }, {
                    label: '战败率',
                    explain: [
                    '【字段解释】已留档潜客战败的比率；',
                    '【计算规则】战败率=战败数/（本月战败总数+本月初遗留潜客数）'
                    ]
                }, {
                    label: '本月初遗留订单数',
                    explain: ['【字段解释】本月月初1号凌晨0点，遗留未交车的订单数；']
                }, {
                    label: '交车数',
                    explain: [
                    '【字段解释】通过汽车销冠进行交车操作的交车总数；']
                }, {
                    label: '订单交车率',
                    explain: [
                    '【字段解释】已下订客户的交车比率；',
                    '【计算规则】订单交车率=交车数/（本月下订总数+本月初遗留订单数）'
                    ]
                }, {
                    label: '退订数',
                    explain: [`【字段解释】通过汽车销冠进行取消订单操作的退订总数；`]
                }, {
                    label: '订单退订率',
                    explain: [
                    `【字段解释】已下订客户的退订比率；`,
                    '【计算规则】订单退订率=退订数/（本月下订总数+本月初遗留订单数）'
                    ]
                }]
        }],
        shopExplain: [  // 单店考核任务释义
            {
                item: '顾问数',
                describe: '顾问数：店内销售顾问/DCC邀约员/网销顾问（含销售组长）的账号数量总和；',
                target: ''
            },{
                item: '回访目标',
                describe: '销售顾问/DCC邀约员/网销顾问通过APP使用“电话”呼出跟进，跟进记录生成“电话”或“智能通话”标签的真实回访数（不包含未通过“电话”呼出手动添加的跟进记录）；',
                target: '电话回访数【 ？】>顾问账号数*电话呼出数**个/天*6天'
            },{
                item: '点评目标',
                describe: '销售管理层通过APP对销售顾问跟进任务进行点评的点评数量；',
                target: '跟进点评数【 ？】>顾问账号数*点评数**个/天*6天'
            },{
                item: '试驾目标',
                describe: '通过汽车销冠“智能试驾”进行试驾登记的试驾数量；',
                target: '智能试驾数【 ？】>顾问账号数*智能试驾数**个/天*6天'
            },{
                item: '跟进任务处理',
                describe: '当前时间点，逾期未跟进（提醒跟进后，当日未完成跟进）的跟进任务数量；',
                target: '当前逾期跟进数【 ？】<**批次'
            },{
                item: '客流任务',
                describe: '当前时间点，逾期未补充（分配客流后，当日未完成补充）的待补充客流数量；',
                target: '当前逾期客流数【 ？】<**批次'
            },{
                item: '战败申请处理',
                describe: '当前时间点，待审核处理的战败申请数量；',
                target: '当前待处理战败数【 ？】<**批次'
            },{
                item: '资料缺少处理',
                describe: '当前时间点，待完善的资料缺少（来源潜客导入）数量；',
                target: '当前资料缺少数【 ？】<**批次'
            }
        ]
      }
    },
    methods: {
        handleClose() {
            this.$emit("cancel");
        }
    }
  }

</script>

<style lang="scss">
    .explain {
        .el-table__header th, 
        .el-table__body td {
            text-align: center;
        }

        .el-table__row {
            &>td:nth-child(3),
            &>td:nth-child(4) {
                padding: 0;

                .cell {
                    padding: 0;
                }

                .content-rowspan {
                    height: 80px;
                    line-height: 18px;
                }
            }

            &>td:nth-child(4) {
                .content-rowspan {
                    align-items: flex-start;
                    justify-content: flex-start;

                    p {
                        margin: 5px 0;
                        color: #606266;
                    }
                }
            }

            & > td {
                background-color: #fff !important;
            }
        }
    }

    .taskExplain {
        .el-table__body td {
            .cell {
                text-align: left;
            }

            &:nth-child(1) {
                .cell {
                    text-align: center;
                }
            }
        }
    }
</style>
